//! ```cargo
//! [dependencies]
//! rand = "0.8"
//! regex = "1"
//! ```

使用 std::io::{self, Write};
使用 rand::Rng;

函数 主程序() {
    打印ln!("欢迎来到猜数字游戏");
    让 可变 随机数 = rand::thread_rng();
    让 要猜的数 = 随机数之gen_range(0..10);
    
    打印ln!("请输入一个数字");
    循环 {
        让 可变 输入 = 字符串::新建();
    
        标准输入()之读取输入(引用可变 输入)之预期("读取失败");
    
        让 数字: 32位整数 = 输入之修剪()之转数字()之预期("转换数字失败");
     
        如果 数字 等于 要猜的数 {
            打印ln!("恭喜你猜对了");
            返回;
        } 否则 如果 数字 大于 要猜的数 {
            打印ln!("猜大了");
        } 否则 如果 数字 小于 要猜的数 {
            打印ln!("猜小了");
        }
    }
}
